token = '1869194584:AAHj_lk94Udm5wr2JKL2UfPVsGBkF56WkwU'

birthday_poem = """
Nun hast Du fünfundvierzig Jahre schon vollbracht,
da wollen wir natürlich, dass es kracht,
denn Du bist schon eine besondere Nummer,
machst uns ja leider auch manchmal Kummer,
bist lebhaft, laut, ein bisschen schrill,
ein Wirbelwind, wenn man so will,
bringst Schwung in unser Leben rein,
mit Witz und Charme und nicht nur Schein,
so sagen wir es unkompliziert,
Zum Geburtstag sei Dir gratuliert!
"""

painter_list = """
Список самых прикольных художников и ключевым словам, по которым можно найти информацию о них:

Леонардо да Винчи (лео)
Пабло Пикассо (пабло)
Энди Уорхол (энди)
Эдвард Мунк (мунк)
Гюстав Климт (климт)
Фрида Кало (кало)
Клод Моне (моне)
Винсент ван Гог (гог)
"""

style_list = """
Список наиболее популярных стилей живописи (для получения информации введите название стиля):

Импрессионизм
Кубизм
Супрематизм
Сюрреализм
Экспрессионизм
Модернизм
Неоклассицизм
Поп-арт
Романтизм
"""

info = {
'лео': [
    'leo.jpg',
    """
    ЛЕОНАРДО ДА ВИНЧИ (1452-1519)

Леонардо да Винчи был итальянским художником, скульптором, математиком и изобретателем, а так же занимался изысканиями в архитектуре, науке, музыке, инженерном деле, астрономии, геологии и многих других областях. Именно поэтому он получил имя “Человек эпохи возрождения”, так как обладал знаниями практически во всех областях, доступных в то время. Вероятно, самым известным его полотном можно назвать “Мону Лизу” (1503-1506), которая считается самой посещаемой, узнаваемой и пародируемой картиной за свою историю.

Причиной её популярности является неуловимая загадочность, таинственная улыбка изображённой на портрете девушки. Многие историки, впервые увидев эту картину, описали её как нечто, чего ни одна фотография не могла бы запечатлеть. Считается, что на портрете изображена Лиза дель Джокондо, жена Франческо дель Джокондо. Итальянское название “Моны Лизы” - “La Gioconda”, что означает “jocund” (счастливый или живой, что можно считать игрой слов с фамилией семьи – Giocondo. Французское название картины, “La Joconde”, имеет то же значение).
    """
],
'гог': [
    'gog.jpg',
    """
    ВИНСЕНТ ВАН ГОГ (1853-1890)

Винсент ван Гог - голландский пост-импрессионистом, по сей день считающийся одним из самых известных и влиятельных художников западного искусства. Им были созданы около 2000 работ в промежуток времени лишь немногим больше 10 лет. Среди них около 800 были написаны в последние несколько лет его жизни. Он покончил с собой в возрасте 37 лет по причине серьёзных психических расстройств и бедности.

“Звёздная ночь” (1889) – одна из его самых известных работ, написанная им во время пребывания в психиатрической больнице во Франции. Она представляет собой вид из окна на вымышленную деревню, над которой всходит яркое жёлтое солнце. Это одна из самых узнаваемых картин не только в мире искусства, но и во всём мире.
    """
],
'пабло': [
    'pablo.jpg',
    """
ПАБЛО ПИКАССО (1881-1973)

Испанский художник вёл творческую жизнь, став в дальнейшем одним из самых влиятельных и знаменитых художников 20-го столетия. Он не только писал картины, но так же был скульптором, поэтом, драматургом. И всё это помимо огромного количества его прочих занятий. Одной из его лучших работ можно считать “Гернику” (1937), создававшуюся как ответ на бомбардировки гитлеровскими войсками баскского города Герника.

Это была одна из многих бомбардировок, длившаяся более двух часов и унёсшая тысячи невинных жизней. Сегодня картина является напоминанием об этой трагедии и последствиях войны для людей, простых граждан в особенности. После того, как Пикассо завершил “Гернику”, полотно отправилось в непродолжительный тур, став популярным антивоенным символом и приобрело известность как среди критиков, так и простых людей.
    """
],
'кало': [
    'kalo.jpg',
    """
    ФРИДА КАЛО (1907-1954)

Одна из сильнейших художниц своего времени, остающаяся таковой по сей день, Фрида Кало была мексиканской сюрреалисткой, наиболее известной за свои автопортреты, пропитанные одиночеством и отрешённостью. Её произведения расцениваются как символические для мексиканских традиций, а также широко любимы феминистками за их яркое и достоверное изображение внутреннего мира женщины.

Одними из ее самых известных работ являются “Автопортрет с терновым ожерельем и колибри” (1940). Они наиболее примечательны как пример её свободного пользования символизмом. Ожерелье с шипами и безжизненно висящая колибри, возможно, символизировали её внутреннюю агонию.
    """
],
'климт': [
    'klimt.jpg',
    """
    ГЮСТАВ КЛИМТ (1862-1918)

Густав Климт был австрийским художником-символистом, наиболее известным благодаря работам, посвященным откровенному эротизму, многообразным росписям, эскизам и натюрмортам. Наряду с изображением женского тела Климт также рисовал пейзажи и сценки, частично находясь под влиянием японского искусства. Одной из его самых известных работ является «Поцелуй» (1907-1908), одна из жемчужин его золотого периода. Этот период его работ определялся эффектным применением золотых оттенков в работах, часто с использованием настоящего золотого листа.
    """
],
'энди': [
    'andy.jpg',
    """
    ЭНДИ УОРХОЛ (1928-1987)

Энди Уорхол был американским визуальным художником, который больше всего известен своим стилем под названием “поп-арт:. В своих работах он изучал отношения между гламурной киноиндустрией, рекламой, популярной культурой и художественным выражением.

Его самая известная работа - “банки с супом Кэмпбелл” (1962), которая состоит из 32 фрагментов, каждый из которых составляет 51 сантиметр в высоту и 41 сантиметр в ширину. Каждый из элементов можно считать отдельной картиной. Индивидуальные части были изготовлены с использованием полуавтоматизированной трафаретной печати, что очень помогло в развитии поп-арта и конвергенции популярной культуры с визуальным искусством, каким мы знаем его сегодня.
    """
],
'мунк': [
    'munk.jpg',
    """
    ЭДВАРД МУНК (1863-1944)

Эдвард Мунк был норвежским художником-экспрессионистом и гравёром. Он известен своими психологическими темами и обертонами, на которые в значительной степени повлиял символизм 19 века. Его же работы сильно повлияли на немецкий экспрессионизм начала 20-го века.

Его самая известная и узнаваемая картина - “Крик” (1893-1910), которая имеет четыре отдельные версии в двух разных вариантах: выполненные маслом и пастелью. Картина примечательно болезненными и резкими, но в то же время со вкусом подобранными цветами, и изображённой на сильно примитизированном лице застывшей эмоцией на ярко-оранжевом фоне.
    """
],
'моне': [
    'mone.jpg',
    """
    КЛОД МОНЕ (1840-1926)

Клод Моне, часто называемый одним из основателей импрессионизма, был французским художником и одним из самых ярких и талантливых пионеров французского импрессионистического движения. Фактически, сам термин «импрессионизм» был придуман после создания им картины под названием «Impression, Soleil Levant» («Впечатление, восход солнца»).

Его самая известная работа - «Водяные лилии» (с 1840 по 1926 год), серия из 250 картин с изображением сада в доме французского художника в Живерни, Франция. Эта серия была основным направлением творчества художника в течение последних 30 лет его жизни.
    """
],
'импрессионизм': [
    'imp.jpg',
    """
ИМПРЕССИОНИЗМ

    Импрессионизм получил свое название благодаря картине «Impression, soleil levant» Клода Моне. Импрессионизм – стиль живописи, который, как правило, направлен на работу на открытом воздухе. Живопись в данном направлении призвана передать световое ощущение мастера.

К ключевым характеристикам импрессионизма относятся: тонкие, относительно небольшие, еле видимые мазки; точно переданное изменение освещения; открытая композиция; присутствие какого-либо движения; необычное видение предметов.

Клод Моне “Впечатление. Восходящее солнце”
    """
],
'кубизм': [
    'cube.jpg',
    """
    КУБИЗМ

Кубизм – это авангардное направление искусства, которое зародилось в XX веке благодаря знаменитому Пабло Пикассо. Поэтому именно он и является самым ярким представителем этого стиля. Отметим, что данное направление произвело революцию в скульптуре и живописи Европы, вдохновив также схожие направления в архитектуре, литературе и музыке.

Для произведений искусства в этом стиле характерны перекомбинированные, ломаные предметы в абстрактной форме.

Пабло Пикассо “Дора Маар”
    """
],
'супрематизм': [
    'super.jpg',
    """
    СУПРЕМАТИ́ЗМ
Супрематизм — это течение в искусстве авангарда. Его основоположником был советский художник и педагог Казимир Малевич. Первой работой в этом стиле эксперты считают «Черный квадрат», или, как назвал его сам автор, «Основной супрематический элемент. Квадрат. 1913».
“
Супрематисты стремились передать окружающую действительность с помощью цвета и геометрических форм: прямой линии, квадрата, круга и прямоугольника. Комбинируя их, художники создавали асимметричные произведения: «Супрематизм» Николая Суетина, «Баба с граблями и ребенком» Веры Ермолаевой, «Супрематический балет» Нины Коган и другие.

Каземир Малевич, Супрематическая композиция
    """
],
'сюрреализм': [
    'sur.jpg',
    """
    СЮРРЕАЛИЗМ

    Про сюрреализм, в отличие, скажем, от фовизма, действительно, знают все. Считается, что это какая-нибудь бредятина, изображенная с предельной достоверностью. Картина Сальвадора Дали, короче.

    Можно сказать, что Дали для очень многих олицетворяет это течение и просто равен ему. Он, кстати, так и говорил, не скромничая: «Сюрреализм – это я». Нет, конечно, что и говорить, Дали – это голова и самый известный в мире сюрреалист, но синонимом сюрреализма он был не всегда.

    Сальвадор Дали. Искушение св. Антония
    """
],
'экспрессионизм': [
    'exs.jpg',
    """
    ЭКСПРЕССИОНИЗМ

Экспрессионизм – одно из современных направлений искусства, которое зародилось в Германии примерно в первой половине XX века. Вначале экспрессионизм охватывал только поэзию и живопись.

Экспрессионисты обычно изображают окружающий мир лишь субъективно, полностью искажая реальность для еще большего эмоционального эффекта. Таким образом, они заставляют своего зрителя задуматься.

Эмиль Нольде. Натюрморт с масками
    """
],
'модернизм': [
    'mode.jpg',
    """
    СОДЕРНИЗМ

Модернизм демонстрирует совокупность разных тенденций культуры, а также ряд объединенных направлений искусства, которые зародились в XIX и XX вв.

Живописцы называют модернизм «иным искусством», цель которого создать уникальные, ни на что не похожие картины, то есть они показывают особенное видение художника.

Анри Матисс “Танцовщица в синем платье”
    """
],
'неоклассицизм': [
    'neo.jpg',
    """
    НЕОКЛАССИЦИЗМ

Неоклассицизм являлся главным направлением в Северной Европе примерно XVIII и XIX вв., для которого характерно искусство эпохи Возрождения, античности и даже классицизма.

Благодаря своим глубоким знаниям церковных законов, мастера неоклассицизма старались реконструировать, а также вводить каноны в свои работы.

Николя Пуссен "Парнас"
    """
],
'поп-арт': [
    'pop.jpg',
    """
    ПОП-АРТ

Поп-арт, как стиль искусства, возник примерно в 1950-х в Великобритании и чуть позже в Америке. Говоря о поп-арте, просто нельзя не вспомнить Энди Уорхола, который является одним из наиболее популярных представителей данного направления.

Основной темой поп-арта выступают обычные предметы. Он акцентирует внимание на вульгарных и банальных элементах любой культуры, как правило, иронизируя их. Поп-арт довольно популярен в различных аспектах массового искусства: комиксах, рекламе и т. д.

Энди Уорхол “Доллар”
    """
],
'романтизм': [
    'rom.jpg',
    """
    РОМАНТИЗМ

Романтизм как направление искусства зародился в XVIII веке в Европе. Истинным источником эстетического познания считались сильные эмоции. Больше всего ценились такие эмоции, как благоговение, страх, ужас и трепет.

Франсиско Гойя “Трибунал инквизиции”

    """
]    
}